Table of Contents
 Class InternalForcesData
Namespace
IdeaStatiCa.BimApi.Results
Assembly
IdeaStatiCa.BimApi.dll
public class InternalForcesData : IIdeaResultData
Inheritance
object
InternalForcesData
Implements
IIdeaResultData
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 Mx
Bending moment around x-axis
public double Mx { get; set; }
Property Value
double
 My
Bending moment around y-axis
public double My { get; set; }
Property Value
double
 Mz
Bending moment around z-axis
public double Mz { get; set; }
Property Value
double
 N
Normal force
public double N { get; set; }
Property Value
double
 Qy
Shear force in y direction
public double Qy { get; set; }
Property Value
double
 Qz
Shear force in z direction
public double Qz { get; set; }
Property Value
double
 Edit this page